/*
##############################################################################
##############################################################################
##
## Модуль генерации прямоугольных импульсов
## Модуль обеспечивает генерацию импульсов в диапазоне частот от 1 Гц до 
## 100 кГц, используя изменение системной частоты и делители таймера.
## Частота стабильная, артефактов генерируемой частоты нет.
## Максимальное отклонение генерируемой частоты от заданной - не более 120 Гц
##
##############################################################################
##############################################################################
*/

#ifndef __RECT_SIGNAL_H
#define __RECT_SIGNAL_H

/* Includes ------------------------------------------------------------------*/

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32f3xx_hal.h"
#include "stm32f3xx_ll_tim.h"

#ifdef __cplusplus
}
#endif

/* Definitions ---------------------------------------------------------------*/

#define RECT_MIN_FREQ   1      // минимальная частота прямоугольного сигнала
#define RECT_MAX_FREQ   100000 // максимальная частота 

/* Functions -----------------------------------------------------------------*/

void rect_signal_init(void);

/* External functions --------------------------------------------------------*/

extern uint8_t ChangePLL(uint8_t PreDiv, uint8_t PLLMUL);
extern void DrawMainScreen(char *title);
extern void (*esc_func)(void);

/* External variables --------------------------------------------------------*/

extern TIM_HandleTypeDef htim1;
extern t_keys_handlers keys_handlers;
extern const uint32_t gen_freq_step_arr [];   // шаг изменения частоты
extern const char *gen_freq_step_name_arr []; // названия шага изменения частоты
extern uint8_t gen_freq_step_idx;             // переменная хранения шага изменения частоты
extern uint8_t change_num; // что изменяется кнопками изменения: 0 - частота, 1 - шаг изменения частоты, 2 - другое
extern UART_HandleTypeDef huart1;
extern char tmp_str[30];

#endif /* __RECT_SIGNAL_H */ 
/*----------------------------------------------------------------------------*/
