/*
##############################################################################
##############################################################################
##
## Главная функция проекта
##
##############################################################################
##############################################################################
*/

/* Includes ------------------------------------------------------------------*/

#include "main.h"
#include "hardware.h"
#include "lcd.h"
#include <string.h>
#include <stdio.h>
#include <math.h>

/* Variables -----------------------------------------------------------------*/

void (*pLoop_Func)(void) = NULL; // указатель на функцию, вызываемую в бесконечном цикле
void (*esc_func)(void) = NULL;   // указатель на функцию выхода из модуля
uint16_t main_loop_time = MAIN_LOOP_TIME_DEFAULT;
uint8_t  change_num = 0; // что изменяется кнопками изменения: 0 - частота, 1 - шаг изменения частоты, 2 - другое
// шаг изменения частоты
// 1 Hz, 5 Hz, 10 Hz, 50 Hz, 100 Hz, 500 Hz, 1 kHz, 5 kHz, 10 kHz, 50 kHz, 100 kHz
// 1, 5, 10, 50, 100, 500, 1, 5, 10, 50, 100
const char *gen_freq_step_name_arr [] = {"1 Hz", "5 Hz", "10 Hz", "50 Hz", "100 Hz", "500 Hz", "1 kHz", "5 kHz", "10 kHz", "50 kHz", "100 kHz"};
const uint32_t gen_freq_step_arr [] = {1, 5, 10, 50, 100, 500, 1000, 5000, 10000, 50000, 100000};
uint8_t gen_freq_step_idx;             // переменная хранения шага изменения частоты
char tmp_str[30], *tmp_str_ptr;
void (* dma_buf_first_half_init_pointer)();
void (* dma_buf_second_half_init_pointer)();

sysclk_gen_t work_freqs[] = {{8, 2, 0.0}, {7, 2, 0.0}, {6, 2, 0.0}, {8, 3, 0.0}, {5, 2, 0.0}, {7, 3, 0.0},
{4, 2, 0.0}, {7, 4, 0.0}, {5, 3, 0.0}, {8, 5, 0.0}, {3, 2, 0.0}, {7, 5, 0.0}, {4, 3, 0.0}, {5, 4, 0.0},
{6, 5, 0.0}, {7, 6, 0.0}, {8, 7, 0.0}, {2, 2, 0.0}, {8, 9, 0.0}, {7, 8, 0.0}, {6, 7, 0.0}, {5, 6, 0.0},
{4, 5, 0.0}, {7, 9, 0.0}, {3, 4, 0.0}, {8, 11, 0.0}, {5, 7, 0.0}, {7, 10, 0.0}, {2, 3, 0.0}, {7, 11, 0.0},
{5, 8, 0.0}, {8, 13, 0.0}, {3, 5, 0.0}, {7, 12, 0.0}, {4, 7, 0.0}, {5, 9, 0.0}, {6, 11, 0.0}, {7, 13, 0.0},
{8, 15, 0.0}, {1, 2, 0.0}, {7, 15, 0.0}, {6, 13, 0.0}, {5, 11, 0.0}, {4, 9, 0.0}, {7, 16, 0.0}, {3, 7, 0.0},
{5, 12, 0.0}, {2, 5, 0.0}, {5, 13, 0.0}, {3, 8, 0.0}, {4, 11, 0.0}, {5, 14, 0.0}, {1, 3, 0.0}, {5, 16, 0.0},
{4, 13, 0.0}, {3, 10, 0.0}, {2, 7, 0.0}, {3, 11, 0.0}, {4, 15, 0.0}, {1, 4, 0.0}, {3, 13, 0.0}, {2, 9, 0.0},
{3, 14, 0.0}, {1, 5, 0.0}, {3, 16, 0.0}, {2, 11, 0.0}, {1, 6, 0.0}, {2, 13, 0.0}, {1, 7, 0.0},
{2, 15, 0.0}, {1, 8, 0.0}, {1, 9, 0.0} };

control_data_t control_data;


/* Functions -----------------------------------------------------------------*/


/*----------------------------------------------------------------------------*\
main
\*----------------------------------------------------------------------------*/
int main(void)
{
   HAL_Init();
   SystemClock_Config();
   MX_GPIO_Init();
   MX_SPI2_Init();
   ST7735_Init();

   MX_USART1_UART_Init();
   HAL_UART_Transmit(&huart1, (uint8_t*)"System started\r\n", 16, 1000);  
   HAL_UART_Transmit(&huart1, (uint8_t*)"~~~~~~~~~~~~~~\r\n", 16, 1000);  
 
   // поднимем скорость SPI
   // при инициализации скорость SPI небольшая, чтобы дисплей гарантированно
   // инициализировался, потом скорость можно поднять до максимума
   SPI2->CR1 &= 0b1111111111000111;

   DebugExplainRCC_RC((uint32_t)(RCC->CR));
   DebugExplainRCC_CFGR((uint32_t)(RCC->CFGR));
   DebugExplainRCC_CFGR2((uint32_t)(RCC->CFGR2));
   DebugShowRCC((uint32_t)(RCC->CR), (uint32_t)(RCC->CFGR), (uint32_t)(RCC->CFGR2));

/*----------------------------------------------------------------------------*/
   
   menu_init();
   
   while (1)
   {
      // задержка цикла
      HAL_Delay(main_loop_time);
      // если определена функция для циклического вызова, запустим её
      // это самая главная функция программы
      // через неё осуществляется передача управления между модулями
      if (pLoop_Func != NULL) pLoop_Func();
   }
}

/*----------------------------------------------------------------------------*/
